Revit 2027 API
Workset.IsVisibleByDefault Property
 Whether the workset is visible by default.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsVisibleByDefault { get; }
Public ReadOnly Property IsVisibleByDefault As Boolean
	Get
public:
property bool IsVisibleByDefault {
	bool get ();
}
member IsVisibleByDefault : bool with get
Property Value
Boolean
Exceptions
Exception | Condition
InvalidOperationException |  WorksetDefaultVisibilitySettings is not applicable to family documents.
See Also
Reference
Workset Class
Autodesk.Revit.DB Namespace